testplan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <org.apache.jorphan.collections.HashTree>
    <ThreadGroup testname="ThreadGroup">
      <intProp name="ThreadGroup.num_threads">50</intProp>
      <intProp name="ThreadGroup.ramp_time">10</intProp>
      <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
        <boolProp name="LoopController.continue_forever">false</boolProp>
        <intProp name="LoopController.loops">10</intProp>
      </elementProp>
    </ThreadGroup>
    <org.apache.jorphan.collections.HashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Open Homepage">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">automationintesting.online</stringProp>
        <intProp name="HTTPSampler.port">443</intProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.path">/</stringProp>
        <stringProp name="HTTPSampler.method">GET</stringProp>
      </HTTPSamplerProxy>
      <org.apache.jorphan.collections.HashTree/>
      <ResultCollector>
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results.jtl</stringProp>
      </ResultCollector>
      <org.apache.jorphan.collections.HashTree/>
    </org.apache.jorphan.collections.HashTree>
    <TestPlan testname="Sample Load Test">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <org.apache.jorphan.collections.HashTree/>
  </org.apache.jorphan.collections.HashTree>
</jmeterTestPlan>